{
    "_config_": {},
    "CreateRangeChartParams": {
        "meta": {
            "displayName": "createRangeChart params"
        },
        "chartType": {
            "isRequired": true,
            "interfaceHierarchyOverrides": {
                "exclude": [],
                "include": [
                    "ChartType"
                ]
            }
        },
        "cellRange": {
            "isRequired": true,
            "description": "Defines the range of cells to be charted. A range is normally defined with start and end rows and a list of columns. If the start and end rows are omitted, the range covers all rows (i.e. entire column contents are selected). The columns can either be defined using a start and end column (the range will cover the start and end columns and all columns in between), or columns can be supplied specifically in cases where the required columns are not adjacent to each other. See [Add Cell Range](/range-selection/#api-addcellrange-rangeselection) for more information."
        },
        "chartThemeName": {
            "options": [
                "ag-default",
                "ag-default-dark",
                "ag-material",
                "ag-material-dark",
                "ag-pastel",
                "ag-pastel-dark",
                "ag-vivid",
                "ag-vivid-dark",
                "ag-solar",
                "ag-solar-dark"
            ],
            "description": "The default theme to use for the created chart. In addition to the default options you listed, you can also provide your own [custom chart themes](/integrated-charts-customisation/#custom-chart-themes)."
        },
        "chartContainer": {
            "description": "If the chart is to be displayed outside of the grid then a chart container should be provided. If the chart is to be displayed using the grid's popup window mechanism then leave as `undefined`."
        },
        "suppressChartRanges": {
            "default": false,
            "description": "By default, when a chart is displayed using the grid, the grid will highlight the range the chart is charting when the chart gets focus. To suppress this behaviour, set `suppressChartRanges=true`."
        },
        "aggFunc": {
            "description": "The aggregation function that should be applied to all series data. The built-in aggregation functions are <code>'sum'</code>, <code>'min'</code>, <code>'max'</code>, <code>'count'</code>, <code>'avg'</code>, <code>'first'</code>, <code>'last'</code>. Alternatively, custom aggregation functions can be provided if they conform to the <code>IAggFunc</code> interface shown here."
        },
        "unlinkChart": {
            "default": false,
            "description": "When enabled the chart will be unlinked from the grid after creation, any updates to the data will not be reflected in the chart.",
            "more": {
                "name": "Unlinking Charts",
                "url": "/integrated-charts-toolbar/#unlinking-charts"
            }
        },
        "chartThemeOverrides": {
            "description": "Allows specific chart options in the current theme to be overridden.",
            "more": {
                "name": "Overriding Existing Themes",
                "url": "/integrated-charts-customisation/#overriding-existing-themes"
            }
        }
    }
}