{
    "Simple Column": {
        "description": "The column chart represents data as a series of vertical columns."
    },
    "Grouped Column": {
        "description": "The column chart represents data as a series of vertical columns grouped together."
    },
    "Stacked Column": {
        "description": "The column chart represents data as a series of stacked vertical columns."
    },
    "Percentage Column": {
        "description": "A column chart showing the normalisation of data into percentages."
    },
    "Column With Negative Numbers": {
        "description": "A column chart showing use of negative numbers."
    },
    "Simple Bar": {
        "description": "The bar chart represents data as a series of horizontal bars."
    },
    "Grouped Bar": {
        "description": "The bar chart represents data as a series of horizontal bars grouped together."
    },
    "Stacked Bar": {
        "description": "The bar chart represents data as a series of stacked horizontal bars."
    },
    "Percentage Bar": {
        "description": "A bar chart showing the normalisation of data into percentages."
    },
    "Bar With Negative Numbers": {
        "description": "A bar chart showing use of negative numbers."
    },
    "Simple Pie": {
        "description": "The pie chart represents proportional data as a pie."
    },
    "Simple Doughnut": {
        "description": "The doughnut chart shows multiple pie series."
    },
    "Simple Line": {
        "description": "The line chart represents data using a number of lines."
    },
    "Line With Gaps": {
        "description": "This example shows how the line series handles gaps in the data."
    },
    "Line With Irregular Time Intervals": {
        "description": "This example demonstrates the plotting of irregular data on a time axis."
    },
    "Simple Scatter": {
        "description": "This scatter chart shows how independent variables can be plotted against each other."
    },
    "Simple Bubble": {
        "description": "This bubble chart shows how independent variables can be plotted against each other including a third dimension."
    },
    "Simple Area": {
        "description": "This area chart represents data using areas."
    },
    "Stacked Area": {
        "description": "This demonstrates an area chart with stacked areas."
    },
    "Percentage Area": {
        "description": "An area chart showing the normalisation of data into percentages."
    },
    "Area With Negative Values": {
        "description": "An area chart demonstrating the support of negative values."
    },
    "Area With Real-Time Data": {
        "description": "This example demonstrates how the chart responds to data being updated in real-time."
    }
}