{
    "callbacks": {
        "meta": {
            "displayName": "Callbacks"
        },
        "isExternalFilterPresent()": {
            "description": "Grid calls this method to know if external filter is present."
        },
        "doesExternalFilterPass(node)": {
            "description": "Should return <code>true</code> if external filter passes, otherwise <code>false</code>."
        },
        "getRowClass(params)": {
            "description": "Callback version of property <code>rowClass</code>. Function should return a string or an array of strings."
        },
        "getRowStyle(params)": {
            "description": "Callback version of property <code>rowStyle</code>. Function should return an object of CSS values."
        },
        "getRowHeight(params)": {
            "description": "Callback version of property <code>rowHeight</code>. Function should return a positive number, or return <code>null</code>/<code>undefined</code> to use the default row height."
        },
        "headerCellRenderer(params)": {
            "description": "Provide a function for custom header rendering."
        },
        "groupRowAggNodes(nodes)": {
            "description": "Callback for grouping.",
            "more": {
                "name": "Row Grouping",
                "url": "../javascript-grid-grouping/#groupingCallbacks"
            }
        },
        "getBusinessKeyForNode(node)": {
            "description": "Return a business key for the node. If implemented, each row in the DOM will have an attribute <code>row-id='abc'</code> where <code>abc</code> is what you return as the business key. This is useful for automated testing, as it provides a way for your tool to identify rules based on unique business keys."
        },
        "getHeaderCellTemplate": {
            "description": "Function to use instead of <code>headerCellTemplate</code>. Should return string or HTML DOM element."
        },
        "getNodeChildDetails(callback)": {
            "description": "Allows you to pass tree structure data to the grid, or row data that is already grouped."
        },
        "getChildCount(data)": {
            "description": "(For <a href='../javascript-grid-server-side-model/'>Server-side Row Model</a> only) Allows setting the child count for a group row."
        },
        "processRowPostCreate(params)": {
            "description": "Allows you to process rows after they are created, so you can do final adding of custom attributes etc."
        },
        "getRowNodeId(data)": {
            "description": "Allows you to set the ID for a particular row node based on the data. Useful for selection and server side sorting and filtering for paging and virtual pagination."
        },
        "isFullWidthCell(rowNode)": {
            "description": "Tells the grid if this row should be rendered using <a href='../javascript-grid-master-detail/'>fullWidth</a>"
        },
        "isRowSelectable(rowNode)": {
            "description": "Callback to be used to determine which rows are selectable. By default rows are selectable, so return <code>false</code> to make a row un-selectable.",
            "more": {
                "name": "Specify Selectable Rows",
                "url": "../javascript-grid-selection/#specify-selectable-rows"
            }
        },
        "isRowMaster(dataItem)": {
            "description": "Callback to be used with <a href='../javascript-grid-master-detail'>Master Detail</a> to determine if a row should be a master row. If <code>false</code> is returned no detail row will exist for this row."
        },
        "postSort(rowNodes)": {
            "description": "Callback to perform additional sorting after the grid has sorted the rows.",
            "more": {
                "name": "Post Sort",
                "url": "../javascript-grid-sorting/#post-sort"
            }
        },
        "navigateToNextCell(params)": {
            "description": "Allows overriding the default behaviour for when user hits navigation (arrow) key."
        },
        "tabToNextCell(params)": {
            "description": "Allows overriding the default behaviour for when user hits tab key."
        },
        "getDocument()": {
            "description": "Allows overriding what <code>document</code> is used. Currently used by Drag and Drop (may extend to other places in the future). Use this when you want the grid to use a different <code>document</code> than the one available on the global scope. This can happen if docking out components (something which Electron supports)."
        },
        "getContextMenuItems(params)": {
            "description": "For customising the context menu."
        },
        "getMainMenuItems(params)": {
            "description": "For customising the main 'column header' menu."
        },
        "processCellForClipboard(params)": {
            "description": "Allows you to process cells for the clipboard. Handy if for example you have <code>Date</code> objects that need to have a particular format if importing into Excel."
        },
        "processCellFromClipboard(params)": {
            "description": "Allows you to process cells from the clipboard. Handy if for example you have number fields, and want to block non-numbers from getting into the grid."
        },
        "sendToClipboard(params)": {
            "description": "Allows you to get the data that would otherwise go to the clipboard. To be used when you want to control the 'copy to clipboard' operation yourself."
        },
        "processSecondaryColDef(colDef)": {
            "description": "Callback to be used with pivoting, to allow changing the second column definition."
        },
        "processSecondaryColGroupDef(colGroupDef)": {
            "description": "Callback to be used with pivoting, to allow changing the second column group definition."
        },
        "postProcessPopup(params)": {
            "description": "Allows user to process popups after they are created. Applications can use this if they want to, for example, reposition the popup."
        },
        "defaultGroupSortComparator(nodeA, nodeB)": {
            "description": "Allows default sorting of groups.",
            "more": {
                "name": "Default Group Order",
                "url": "../javascript-grid-grouping/#default-group-order"
            }
        },
        "suppressKeyboardEvent(params)": {
            "description": "Suppress the grid taking action for the relevant keyboard event.",
            "more": {
                "name": "Suppress Grid Keyboard Events",
                "url": "../javascript-grid-keyboard-navigation/#suppressKeyboardEvents"
            }
        },
        "processChartOptions(params)": {
            "description": "Callback to be used to with charts to override default chart options.",
            "more": {
                "name": "Overriding Chart Options",
                "url": "../javascript-grid-charts-customisation/#overriding-chart-options"
            }
        },
        "getChartToolbarItems(params)": {
            "description": "Callback to be used to customise the chart toolbar items.",
            "more": {
                "name": "Configuring Toolbar Items",
                "url": "../javascript-grid-charts-integrated-chart-toolbar/#configuring-toolbar-items-and-menu-panels"
            }
        },
        "paginationNumberFormatter(params)": {
            "description": "Allows user to format the numbers in the pagination panel, i.e. 'row count' and 'page number' labels. This is for pagination panel only, to format numbers inside the grid's cells (i.e. your data), then use <code>valueFormatter</code> in the column definitions."
        }
    }
}